Series

In [6]:
import pandas as pd

In [8]:
list_1 = [10,20,30,40]
pd.Series(data = list_1)

0    10
1    20
2    30
3    40
dtype: int64

In [10]:
li = ['a','b','c']
pd.Series(data = li)

0    a
1    b
2    c
dtype: object

In [12]:
tu = (12,34,56.7)
pd.Series(tu)

0    12.0
1    34.0
2    56.7
dtype: float64

In [16]:
pd.Series(data = li, index = tu)

12.0    a
34.0    b
56.7    c
dtype: object

In [18]:
dic = {'a':23,'b':45,'c':67}
pd.Series(dic)

a    23
b    45
c    67
dtype: int64

In [20]:
pd.Series(data = dic, index = tu)

12.0   NaN
34.0   NaN
56.7   NaN
dtype: float64

In [22]:
pd.Series(data = dic, index = li)

a    23
b    45
c    67
dtype: int64

In [24]:
lii = [3,4,5]
pd.Series(data =dic, index = lii)

3   NaN
4   NaN
5   NaN
dtype: float64

In [26]:
pd.Series(data = dic, index = li)

a    23
b    45
c    67
dtype: int64

In [28]:
pd.Series(data = li, index = dic)

a    a
b    b
c    c
dtype: object

In [30]:
pd.Series(data =lii, index = dic)

a    3
b    4
c    5
dtype: int64

In [32]:
pd.Series(data =dic, index = lii)

3   NaN
4   NaN
5   NaN
dtype: float64

Using the index

In [35]:
s1 = pd.Series(data = [1,2,3,4], index = ['USA', 'UK', 'UAE', 'IND'])
s1

USA    1
UK     2
UAE    3
IND    4
dtype: int64

In [37]:
s2 = pd.Series(data = [1,2,5,4], index = ['USA', 'UK', 'Italy', 'IND'])
s2

USA      1
UK       2
Italy    5
IND      4
dtype: int64

In [39]:
s1['USA']

1

In [41]:
s2['Italy']

5

In [43]:
type(s1)

pandas.core.series.Series

In [45]:
s1+s2

IND      8.0
Italy    NaN
UAE      NaN
UK       4.0
USA      2.0
dtype: float64

In [47]:
s1+s1

USA    2
UK     4
UAE    6
IND    8
dtype: int64

Data Frames

In [56]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(101)

In [58]:
df = pd.DataFrame(randn(5,4),index = ['A','B','C','D','E'], columns = ['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Selection / Indexing => Access

In [61]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [65]:
type(df['W'])

pandas.core.series.Series

In [69]:
df[['W','Z']] # pass by list

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [71]:
df[['W','Z','X']]

          W         Z         X
A  2.706850  0.503826  0.628133
B  0.651118  0.605965 -0.319318
C -2.018168 -0.589001  0.740122
D  0.188695  0.955057 -0.758872
E  0.190794  0.683509  1.978757

In [73]:
# => adding a col
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
#df['new'] = [1,2,3,4,5]
df['new'] = df['X']+df['Z']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266

In [77]:
# remove a col
df.drop('new',axis = 1) # axis = 0=> row

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [79]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266

In [81]:
df.drop('new',axis = 1, inplace = True)

In [83]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [85]:
#ROW = > index = > 0...., label = > A, B,......

df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [87]:
# label based
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [89]:
type(df.loc['A'])

pandas.core.series.Series

In [95]:
df.loc[['C', 'E']] # pass by list

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [97]:
df.loc[['B','D'],['X','Z']]

          X         Z
B -0.319318  0.605965
D -0.758872  0.955057

In [99]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [101]:
df.loc[['C'],['X']]

          X
C  0.740122

In [103]:
df1 = pd.DataFrame(data = [s1,s2])
df1

   USA   UK  UAE  IND  Italy
0  1.0  2.0  3.0  4.0    NaN
1  1.0  2.0  NaN  4.0    5.0

In [109]:
df2 = pd.DataFrame(data = [[1,2,3,4],[5,6,7,8]], index = ['r1','r2'], columns = ['w','x','y','z'])
df2

    w  x  y  z
r1  1  2  3  4
r2  5  6  7  8

In [111]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [113]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [115]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [117]:
# condition selection
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [119]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [121]:
df[df['X']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [123]:
df[df['X']>0]['Y']

A    0.907969
C    0.528813
E    2.605967
Name: Y, dtype: float64

In [127]:
df[df['X']>0][['Y','Z']]

          Y         Z
A  0.907969  0.503826
C  0.528813 -0.589001
E  2.605967  0.683509

In [131]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [129]:
df[(df['X']>0)& (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [133]:
df[(df['X']>0)& (df['Y']>1)]['W']

E    0.190794
Name: W, dtype: float64

In [135]:
df[(df['X']>0)& (df['Y']>1)][['W','Z']]

          W         Z
E  0.190794  0.683509

In [137]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [139]:
df.drop('B',axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [141]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [143]:
df.drop('B',axis = 0, inplace = True)

In [145]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [147]:
# indexing

df_2 = pd.DataFrame(randn(5,4),index = ['A','B','C','D','E'], columns = ['W','X','Y','Z'])
df_2

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [149]:
df_2.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [151]:
df_2 ['new'] = ['USA', 'UK', 'UAE', 'IND','Italy']

In [153]:
df_2

          W         X         Y         Z    new
A  0.302665  1.693723 -1.706086 -1.159119    USA
B -0.134841  0.390528  0.166905  0.184502     UK
C  0.807706  0.072960  0.638787  0.329646    UAE
D -0.497104 -0.754070 -0.943406  0.484752    IND
E -0.116773  1.901755  0.238127  1.996652  Italy

In [155]:
df_2.set_index('new')

              W         X         Y         Z
new
USA    0.302665  1.693723 -1.706086 -1.159119
UK    -0.134841  0.390528  0.166905  0.184502
UAE    0.807706  0.072960  0.638787  0.329646
IND   -0.497104 -0.754070 -0.943406  0.484752
Italy -0.116773  1.901755  0.238127  1.996652

In [157]:
df_2

          W         X         Y         Z    new
A  0.302665  1.693723 -1.706086 -1.159119    USA
B -0.134841  0.390528  0.166905  0.184502     UK
C  0.807706  0.072960  0.638787  0.329646    UAE
D -0.497104 -0.754070 -0.943406  0.484752    IND
E -0.116773  1.901755  0.238127  1.996652  Italy

In [159]:
df_2.set_index('new',inplace = True)

In [161]:
df_2

              W         X         Y         Z
new
USA    0.302665  1.693723 -1.706086 -1.159119
UK    -0.134841  0.390528  0.166905  0.184502
UAE    0.807706  0.072960  0.638787  0.329646
IND   -0.497104 -0.754070 -0.943406  0.484752
Italy -0.116773  1.901755  0.238127  1.996652

In [ ]:
pip install pandas

In [ ]:
import pandas as pd